{
  "Document_name": "R407A_Patch_BAMobileApp_OnePager V2.docx",
  "modified_date": "2025-08-03 23:02:32",
  "content": "PROJECT INFORMATION ONE PAGER \nFOR BA MOBILE APPS TEAM\n\nProject Name: BA Customer Mobile App – GGL Boarding pass changes for Phoenix rebranding.\nTarget Release: R413\nProject Main Contacts: Anubrata, Tathagata, Tushar, Gairik\nForm Completed By: Anubrata Dutta\nDate: 19/04/25\n\nWHY – Changes made to accommodate new tier for GGL members and new colours for boarding passes for GGL members.\nWSAuthenticateAndIssueNonExecBoardingPassV1 \nWSAuthenticateAndIssuePassbookV1 \n\n\nWHAT - Scope (What’s in and What’s out)\nIn Scope (Please list by Regression Functionality, see note below)\nFollowing are the webservices/features in scope of this change.\nWSAuthenticateAndIssueNonExecBoardingPassV1 \nWSAuthenticateAndIssuePassbookV1 \n\nOut of Scope (Please list by Regression Functionality, see note below)\n\n\nHOW – Components that have either been added or amended & how\nChanges have been made to the following CAP webservices:\nWSAuthenticateAndIssueNonExecBoardingPassV1 \nWSAuthenticateAndIssuePassbookV1 \n\nDetails of this change can be found  - https://iagtech.atlassian.net/wiki/spaces/CMA/pages/1893237068/Phoenix+re-branding+boarding+pass+changes\n\n\n\nIs this change reliant on any other development or system change\nN/A\n\n\nAre you doing any code re-factoring as a part of your project in this release?\n YES\n\nData set up requirements and how this can be achieved & what specific scenarios should we ensure are tested – No specific data set up is required. Nothing will be impacted on ba.com. From the Mobile perspective we need to test the following:\nRetrieve boarding pass for Android\nIssue Passbook for iOS\n\nHave you analysed the impact of your changes on mobile? In case there is an impact on mobile, please mention the details. \nThis is a Mobile only change and the details has been provided on the above section(We do some regression testing for mobile so if any of your changes impact functionality/web services on mobile, then please provide the details so that we can analyse and update the test cases accordingly).\n\nFuture regression testing requirements, if any \nN/A(that is, list of scenarios that need to be tested in future releases?)\n\nEnvironment where we can go and have a look at your changes, if any – caplive758(please mentioned your environment details like capdev200..)\n\nAny other useful info: anything not listed above but you think may be useful for regression test team:  N/A\nNotes: List of Regression functionality (if there is an overlap, please mention both):\nFlight Selling\nMobile\nPayment\nLoyalty\nChange Booking\nMMB and Servicing\nPegasus\nBoD\nAPIS\nOther (please describe briefly):\n\n"
}